import 'package:androidyshop/constants/assets.dart';

class Product {
  final int price;
  final String id, title, subTitle, type, company, description, image;

  Product(
      {required this.id,
      required this.title,
      required this.subTitle,
      required this.type,
      required this.description,
      required this.company,
      required this.image,
      required this.price});
}

final List<String> listCompany = [
  "سامسونق",
  "ون بلس",
  "هواوي",
  "موتورولا",
  "نوثينق"
];

// list of products
List<Product> products = [
  Product(
    id: "SAMTS9U",
    price: 1000,
    title: "جالاكسي تاب اس 9 ألترا",
    type: "تابلت",
    subTitle: "اقوى تابلت",
    company: listCompany[0],
    image: st9u,
    description:
        "عندما نتحدث عن التكنولوجيا الرائدة والتصميم الأنيق، فإن تابلت سامسونق اس 9 ألترا يأتي في طليعة الأجهزة التي تجمع بين الأداء القوي والجمال الفائق. هذا الجهاز ليس مجرد تابلت عادي، بل هو تحفة تقنية تدمج بين القوة والذكاء، ليصبح رفيقًا مثاليًا لكل من يبحث عن تجربة استخدام استثنائية. \nأول ما يجذب الأنظار في سامسونق اس 9 ألترا هو شاشته المذهلة ذات القياس الكبير، والتي توفر ألوانًا غنية وتفاصيل حادة بفضل دقتها العالية وتقنية AMOLED المتطورة. هذا يجعل مشاهدة الفيديوهات، وتصفح الصور، وحتى القراءة تجربة لا تضاهى من حيث الجودة والوضوح.",
  ),
  Product(
    id: "SAMPA7",
    price: 130,
    title: "جالاكسي أ7",
    type: "هاتف",
    subTitle: "جودة صوت عالية",
    company: listCompany[0],
    image: a7,
    description:
        "هاتف متوسط من سامسونج A7 يجمع بين التصميم الأنيق والأداء الموثوق به. يأتي الهاتف بشاشة Super AMOLED مقاس 6.4 بوصة تعرض الألوان بوضوح فائق، مما يضمن تجربة مشاهدة مريحة وواقعية. يعمل A7 بمعالج Exynos 9611 الذي يوفر أداءً قويًا وسريعًا لتلبية احتياجاتك اليومية، سواء كانت لتشغيل التطبيقات أو الألعاب. يتوفر الهاتف بذاكرة وصول عشوائي تصل إلى 8 جيجابايت، مما يساعد على تعزيز أداء النظام بشكل عام. يعمل A7 بنظام التشغيل Android 10 مع واجهة One UI التي توفر تجربة استخدام سلسة ومرنة. يأتي الهاتف بكاميرا رباعية تضم عدسة رئيسية بدقة 64 ميجابكسل، مما يساعد على التقاط صور واضحة ومفصلة، بالإضافة إلى كاميرا واسعة الزاوية وكاميرا ماكرو لتنوع في الاستخدام. تتميز A7 أيضًا ببطارية كبيرة بسعة 4500 مللي أمبير تكفي للاستخدام طوال اليوم، مما يجعله خيارًا مناسبًا للأشخاص الذين يتطلعون إلى هاتف متوازن بين الأداء والكفاءة.",
  ),
  Product(
    id: "SAMPA53",
    price: 399,
    title: "جالاكسي أ53",
    type: "هاتف",
    subTitle: "ملك الهواتف المتوسطة",
    company: listCompany[0],
    image: a53,
    description:
        "هاتف متوسط من سامسونج A53 يمثل الجمع المثالي بين الأداء القوي والتصميم الأنيق. يأتي الهاتف بشاشة Super AMOLED مقاس 6.5 بوصة تعرض الألوان بوضوح فائق، مما يجعل تجربة المشاهدة ممتعة وواقعية. يعمل A53 بمعالج Exynos 9611 ثماني النواة الذي يوفر أداءً سريعًا وسلسًا لتشغيل التطبيقات والألعاب بدون تأخير. يأتي الهاتف بذاكرة وصول عشوائي تصل إلى 6 جيجابايت، مما يساعد على تحسين الأداء والاستجابة العامة للنظام. يتميز A53 أيضًا بنظام تشغيل Android 11 مع واجهة One UI 3.1 التي توفر تجربة استخدام سلسة ومستخدمة بديهية. يأتي الهاتف بكاميرا رباعية تضم عدسة رئيسية بدقة 64 ميجابكسل لالتقاط صور واضحة وحادة، بالإضافة إلى كاميرا واسعة الزاوية وكاميرا لتحسين العمق وكاميرا ماكرو لتصوير التفاصيل الدقيقة. يتميز A53 أيضًا ببطارية كبيرة بسعة 5000 مللي أمبير تدوم لفترات طويلة من الاستخدام المتواصل، مما يجعله مثاليًا للأشخاص الذين يحتاجون إلى هاتف يعمل طوال اليوم دون الحاجة إلى إعادة الشحن المتكرر.",
  ),
  Product(
    id: "SAMBFE1",
    price: 99,
    title: "جالاكسي بدز فان ايدشن",
    type: "سماعة",
    subTitle: "صوت عالي",
    company: listCompany[0],
    image: gbfe,
    description:
        "سماعة فئة عليا من سامسونج Galaxy Buds FE تجسد التوازن المثالي بين الأداء المتميز والتصميم الأنيق. تأتي هذه السماعة بتصميم مريح يضمن ارتداءاً مريحاً لساعات طويلة دون إزعاج. تتميز Galaxy Buds FE بمكبرات صوت ديناميكية متطورة لتوفير صوت عالي الجودة مع توزيع ترددات متوازن لتجربة استماع ممتازة. تدعم السماعة تقنية الصوت البيني الذكي (ANC) التي تساعد في إزالة الضوضاء الخارجية لتجربة استماع خالية من التشويش. بالإضافة إلى ذلك، تدعم Galaxy Buds FE تقنية Ambient Sound التي تسمح بسماع الأصوات المحيطة بوضوح أثناء الاستماع. تأتي Galaxy Buds FE ببطارية قوية تدوم حتى 6 ساعات من التشغيل المستمر، مع إمكانية إعادة شحنها بسرعة عبر الشاحن اللاسلكي أو الشاحن السريع. تتميز السماعة بمقاومتها للماء بمعيار IPX7، مما يجعلها مناسبة للاستخدام في الأنشطة الرياضية والأماكن ذات البيئات الرطبة. تدعم Galaxy Buds FE الاتصال بالأجهزة الذكية عبر تقنية Bluetooth 5.0 لضمان اتصال مستقر وموثوق. باختصار، سماعة فئة عليا من سامسونج Galaxy Buds FE تقدم أداء صوتياً متميزاً مع تقنيات متقدمة للحفاظ على جودة الصوت والراحة طوال اليوم، مما يجعلها الخيار الأمثل لمحبي التكنولوجيا الذين يبحثون عن سماعة تلبي احتياجاتهم اليومية بأداء عالي وتصميم أنيق.",
  ),
  Product(
    id: "SAMBpro1",
    price: 179,
    title: "جالاكسي بدز برو",
    type: "سماعة",
    subTitle: "صوت عالي",
    company: listCompany[0],
    image: gbpro,
    description:
        "سماعة فئة عليا من سامسونج Galaxy Buds Pro تعد الخيار المثالي لعشاق الصوتيات الفائقة. تمتاز هذه السماعة بتصميم أنيق ومريح يوفر تجربة استماع استثنائية. تتميز Galaxy Buds Pro بتقنية إلغاء الضوضاء النشطة التي تساعد في تقليل الضوضاء الخارجية وتحسين جودة الصوت المتنقلة. تأتي السماعة بمكبرات صوت ديناميكية بحجم 11 مم لتوفير صوت واضح وعميق مع توزيع متوازن للترددات. تدعم Galaxy Buds Pro أيضاً تقنية Dolby Atmos لتجربة صوتية سينمائية واقعية. تتميز السماعة بميكروفونات مزدوجة ومعالجات خاصة لتحسين جودة المكالمات الصوتية، مما يجعلها مثالية للاستخدام في أي مكان وفي أي وقت. تتميز Galaxy Buds Pro أيضاً بمقاومتها للماء بمعيار IPX7، مما يجعلها مناسبة للاستخدام أثناء ممارسة الرياضة أو في الأماكن ذات البيئات الرطبة. تأتي السماعة ببطارية تدوم حتى 8 ساعات من التشغيل المستمر، مع إمكانية شحنها بشكل سريع للحصول على 1.5 ساعة من الاستخدام بعد 5 دقائق فقط من الشحن. تدعم Galaxy Buds Pro الاتصال بالأجهزة الذكية عبر تقنية Bluetooth 5.0 لضمان الاتصال المستقر والموثوق. باختصار، سماعة فئة عليا من سامسونج Galaxy Buds Pro تجمع بين التصميم الأنيق، والأداء الصوتي المتميز، والتقنيات المتطورة لتجربة استماع ممتازة، مما يجعلها الخيار المثالي للأفراد الذين يبحثون عن سماعة لاسلكية تلبي احتياجاتهم اليومية بأداء مميز.",
  ),
  Product(
    id: "SAMW3",
    price: 129,
    title: "جالاكسي واتش 3",
    type: "ساعة",
    subTitle: "اناقة",
    company: listCompany[0],
    image: gw3,
    description:
        "ساعة فئة عليا من سامسونج Galaxy Watch 3 تمثل تطوراً مذهلاً في عالم الساعات الذكية. تتميز هذه الساعة بتصميم أنيق وفاخر يجمع بين الفولاذ المقاوم للصدأ والزجاج المقاوم للخدش، مما يمنحها مظهراً جذاباً ومتيناً في الوقت ذاته. تأتي Galaxy Watch 3 بشاشة Super AMOLED دائرية بقياس 1.4 بوصة تعرض الألوان بوضوح فائق وتفاصيل دقيقة، مما يجعل استخدامها مريحاً وممتعاً. تعمل الساعة بنظام تشغيل Tizen OS المعتمد من سامسونج، مما يضمن تجربة سلسة وفعالة للمستخدمين مع واجهة مستخدم بديهية ومتعددة الوظائف. Galaxy Watch 3 مزودة بمعالج Exynos 9110 ثنائي النواة الذي يوفر أداءً سريعاً وفعالاً للتطبيقات والخدمات، بالإضافة إلى ذاكرة وصول عشوائي تصل إلى 1 جيجابايت مما يساعد على تشغيل التطبيقات بسلاسة ودون تأخير. تدعم Galaxy Watch 3 مجموعة متنوعة من الميزات الصحية واللياقة البدنية مثل قياس نسبة الأكسجين في الدم، مراقبة معدل ضربات القلب على مدار الساعة، ومتابعة مستوى التنفس والسكون. بالإضافة إلى ذلك، تقدم الساعة مجموعة واسعة من التطبيقات المدمجة لتتبع اللياقة وممارسة التمارين الرياضية. تتميز Galaxy Watch 3 أيضاً بقدرتها على إدارة المكالمات والردود السريعة عبر التوصيل بالهاتف الذكي عبر تقنية Bluetooth، بالإضافة إلى إمكانية إجراء المكالمات الصوتية والاستماع إلى الموسيقى دون الحاجة إلى استخدام الهاتف. تأتي الساعة بمقاومة للماء حتى عمق 50 متراً، مما يجعلها مثالية للارتداء خلال السباحة والأنشطة الرياضية المائية الأخرى. توفر Galaxy Watch 3 بطارية تدوم حتى 2-3 أيام تقريباً حسب الاستخدام، مع دعم تقنية الشحن السريع التي تمكن من شحن الساعة بسرعة. باختصار، ساعة فئة عليا من سامسونج Galaxy Watch 3 تجمع بين التصميم الأنيق، والأداء المتميز، والميزات الصحية الشاملة، مما يجعلها الخيار المثالي للأفراد الذين يبحثون عن ساعة ذكية متطورة لمرافقتهم في حياتهم اليومية بأسلوب عصري وفاخر.",
  ),
  Product(
    id: "SAMW4",
    price: 179,
    title: "جالاكسي واتش 4",
    type: "ساعة",
    subTitle: "اناقة",
    company: listCompany[0],
    image: gw4,
    description:
        "ساعة فئة عليا من سامسونج Galaxy Watch 4 تمثل تطوراً مذهلاً في عالم الأجهزة القابلة للارتداء. تمتاز هذه الساعة بتصميم أنيق ومتين يجمع بين الفولاذ المقاوم للصدأ والزجاج المقاوم للخدش، مما يعزز من مظهرها الجذاب ويضمن قوة تحمل عالية. تأتي Galaxy Watch 4 بشاشة كبيرة Super AMOLED بقياس 1.4 بوصة تعرض الألوان بوضوح وتفاصيل دقيقة، مما يسهم في جعل استخدام الساعة سلس وممتع. تعمل Galaxy Watch 4 بنظام تشغيل Wear OS المعتمد من Google، مما يضمن التوافق العالي مع التطبيقات والخدمات الأخرى المتاحة عبر Google Play Store. تمتاز الساعة بمعالج Exynos W920 القوي الذي يضمن استجابة سريعة وأداء متميز للتطبيقات والألعاب الخفيفة. كما تدعم Galaxy Watch 4 مجموعة متنوعة من الميزات الصحية واللياقة البدنية بما في ذلك قياس مستوى الأكسجين في الدم، مراقبة معدل ضربات القلب على مدار الساعة، وتتبع النوم بدقة. يتميز Galaxy Watch 4 أيضاً بقدرتها على إدارة المكالمات والردود السريعة عبر الردود الذكية والمكالمات الصوتية عبر الاتصال بالهاتف الذكي عبر تقنية Bluetooth. تأتي الساعة بمقاومة للماء حتى عمق 50 مترًا، مما يجعلها مناسبة للارتداء أثناء السباحة والأنشطة الرياضية المائية الأخرى. توفر Galaxy Watch 4 بطارية تدوم حتى 40 ساعة مع شحن سريع يمكن أن يصل إلى 80٪ في أقل من ساعة. باختصار، ساعة فئة عليا من سامسونج Galaxy Watch 4 تجمع بين التصميم الأنيق، الأداء المتميز، والميزات الصحية الشاملة، مما يجعلها الخيار المثالي للأفراد الذين يبحثون عن ساعة ذكية متطورة لتلبية احتياجاتهم اليومية.",
  ),
  Product(
    id: "OP9",
    price: 999,
    title: "ون بلس 9",
    type: "هاتف",
    subTitle: "سرعه",
    company: listCompany[1],
    image: op9,
    description:
        "هاتف فئة عليا من ون بلس 9 هو الجهاز الذي يمثل تجمعاً متقدماً بين التصميم الأنيق والأداء الفائق. يتميز الهاتف بتصميم فريد يجمع بين الزجاج المقاوم للخدش والألمنيوم الخفيف الوزن، مما يمنحه مظهراً راقياً ومقاومة عالية للتآكل. يضم ون بلس 9 شاشة AMOLED كبيرة بحجم 6.55 بوصة، تعرض الألوان بوضوح فائق وتفاصيل دقيقة، مما يجعل تجربة المشاهدة واقعية وممتعة للمستخدمين. يتميز الهاتف بأداء قوي وفعالية عالية بفضل معالج Qualcomm Snapdragon 855 Plus، الذي يتعامل بسلاسة مع التطبيقات الثقيلة والألعاب المتطلبة. يتمتع بذاكرة وصول عشوائي تصل إلى 12 جيجابايت، مما يضمن سرعة استجابة ممتازة وتشغيل متعدد المهام بدون تأخير. كما يأتي الهاتف بخيارات تخزين داخلية تصل إلى 256 جيجابايت، لتخزين كافة الصور والفيديوهات والملفات بكل سهولة. في مجال التصوير، يأتي ون بلس 9 بنظام كاميرا خلفية ثلاثية تضم عدسة رئيسية بدقة 48 ميجابكسل، وعدسة تليفوتوغرافية بدقة 8 ميجابكسل، وعدسة زاوية عريضة بدقة 16 ميجابكسل. يتيح للمستخدمين التقاط صور احترافية بتفاصيل دقيقة وزوايا واسعة، بالإضافة إلى تسجيل فيديوهات بدقة عالية تصل إلى 4K. تأتي البطارية بسعة 4000 ميلي أمبير في الساعة، مع دعم تقنية الشحن السريع Warp Charge 30T، التي تمكن من شحن الهاتف بسرعة استثنائية. يعمل الهاتف بنظام تشغيل OxygenOS المبني على أحدث إصدارات Android، مما يوفر تجربة استخدام سلسة ومتطورة. باختصار، هاتف ون بلس 9 يعد خياراً ممتازاً للأفراد الذين يبحثون عن جهاز فئة عليا يجمع بين التصميم الأنيق، الأداء القوي، وتجربة تصوير متقدمة، مع الحفاظ على ميزانية مناسبة لاحتياجاتهم اليومية.",
  ),
  Product(
    id: "OP10",
    price: 1099,
    title: "ون بلس 10",
    type: "هاتف",
    subTitle: "سرعه",
    company: listCompany[1],
    image: op10,
    description:
        "هاتف فئة عليا من ون بلس 10 هو الجهاز الذي يجمع بين التصميم الأنيق والأداء القوي بميزانية معقولة. يأتي هذا الهاتف بتصميم متميز يجذب الأنظار، مع إطار من الزجاج المقاوم للخدش والألمنيوم الخفيف الوزن، مما يجعله مريحاً في الاستخدام اليومي. شاشة AMOLED كبيرة بحجم 6.7 بوصة تعرض الألوان بوضوح وتفاصيل دقيقة، مما يضمن تجربة مشاهدة ممتعة للمحتوى الوسائطي والألعاب. يتميز ون بلس 10 بأداء قوي بفضل معالج Qualcomm Snapdragon 865 الذي يتعامل بسلاسة مع التطبيقات الثقيلة والألعاب المتطلبة، مع إمكانية الوصول السريع إلى الإنترنت وتحميل البيانات بسرعة فائقة. يتمتع الهاتف أيضاً بذاكرة وصول عشوائي كبيرة وخيارات تخزين تصل إلى 256 جيجابايت، مما يسمح لك بتخزين كل صورك وملفاتك بسهولة دون الحاجة إلى التنقل بين التطبيقات. الكاميرا في ون بلس 10 تعد أحد أبرز مميزاته، حيث تأتي بنظام رباعي الكاميرا بدقة 48 ميجابكسل، مما يسمح لك بالتقاط صور احترافية بتفاصيل دقيقة وألوان حية، بالإضافة إلى إمكانية تسجيل فيديوهات بدقة 4K. يتضمن الهاتف أيضاً كاميرا أمامية بدقة 16 ميجابكسل لالتقاط صور سيلفي عالية الجودة ومكالمات الفيديو. البطارية الكبيرة بسعة 4500 ميلي أمبير في الساعة تضمن لك استخداماً طويلاً دون الحاجة إلى الشحن المتكرر، مع دعم خاصية الشحن السريع التي تتيح لك شحن البطارية بسرعة. يعمل الهاتف بنظام تشغيل OxygenOS المبني على Android 10، مما يوفر لك تجربة استخدام سلسة ومتطورة مع إمكانية الوصول إلى جميع تطبيقات Google Play Store. باختصار، هاتف ون بلس 10 يجمع بين التصميم الأنيق، الأداء القوي، والكاميرا المتطورة، مما يجعله خياراً ممتازاً للأشخاص الذين يبحثون عن جهاز فئة عليا بميزانية مناسبة لاحتياجاتهم اليومية.",
  ),
  Product(
    id: "MPRazer",
    price: 1599,
    title: "موتورولا ريزر",
    type: "هاتف",
    subTitle: "قابل للطي",
    company: listCompany[3],
    image: razer,
    description:
        "هاتف ذكي من الفئة العليا قابل للطي، مقدم من شركة موتورولا. إذا كنت تبحث عن هاتف ذكي يجمع بين الفخامة والتكنولوجيا المتقدمة، فإن هاتف الفئة العليا القابل للطي من شركة موتورولا هو الخيار المثالي لك. يتميز هذا الهاتف بتصميم مبتكر يجعله يتفوق على الهواتف التقليدية. يأتي الهاتف بشاشة مرنة قابلة للطي، مما يمنحك تجربة مشاهدة ممتعة وفريدة من نوعها. سواء كنت تستخدم الهاتف لمشاهدة الفيديوهات أو للعمل، ستجد أن الشاشة الكبيرة والواضحة تلبي جميع احتياجاتك بشكل ممتاز. إلى جانب التصميم المذهل، يتميز هاتف موتورولا القابل للطي بأداء قوي وسريع بفضل المعالج المتطور والذاكرة الكبيرة. ستتمكن من تشغيل التطبيقات الثقيلة والألعاب بسهولة، دون أي تأخير أو تعطل. كما أن الكاميرا في هذا الهاتف هي من الفئة العالية، حيث تمكنك من التقاط صور وفيديوهات بجودة عالية، بفضل العدسات المتقدمة وتقنيات الذكاء الاصطناعي التي تحسن من جودة الصور في جميع الظروف. يتميز الهاتف أيضاً ببطارية قوية تدوم طويلاً، مما يضمن لك الاستخدام المستمر دون الحاجة للشحن المتكرر. ومع خاصية الشحن السريع، يمكنك إعادة شحن البطارية في وقت قصير والعودة لاستخدام الهاتف بسرعة. شركة موتورولا، الرائدة في مجال التكنولوجيا والاتصالات، تضمن لك مع هذا الهاتف مستوى عالٍ من الجودة والأداء. إنها تسعى دائماً لتقديم أحدث التقنيات والابتكارات لمستخدميها، مما يجعلها واحدة من أفضل الشركات في صناعة الهواتف الذكية. باقتناء هاتف موتورولا القابل للطي، ستحصل على جهاز يجمع بين الفخامة والأداء العالي، مع تصميم عصري يناسب جميع الأذواق. هذا الهاتف ليس مجرد أداة اتصال، بل هو تجربة تقنية متكاملة تواكب أحدث التطورات وتلبي جميع احتياجاتك اليومية.",
  ),
  Product(
    id: "MPE20",
    price: 379,
    title: "موتورولا ايدج 20",
    type: "هاتف",
    subTitle: "اقتصادي",
    company: listCompany[3],
    image: edge20,
    description:
        "موتورولا ايدج 20 هو هاتف ذكي من الفئة المتوسطة يتميز بأداء متميز مقابل السعر. إذا كنت تبحث عن جهاز يقدم توازناً مثالياً بين الأداء الجيد والسعر المناسب، فإن موتورولا ايدج 20 هو الخيار الأمثل لك. هذا الهاتف يأتي بتصميم أنيق وعصري يجذب الأنظار، مع شاشة كبيرة وواضحة توفر تجربة مشاهدة مريحة سواء كنت تشاهد الفيديوهات أو تتصفح الإنترنت. يتميز موتورولا ايدج 20 بمعالج قوي يضمن لك تشغيل التطبيقات والألعاب بسلاسة، دون أي تأخير. كما يأتي بذاكرة كبيرة تساعدك على تخزين جميع ملفاتك وصورك بسهولة. الكاميرا في هذا الهاتف تتيح لك التقاط صور واضحة ونقية، بفضل العدسات المتقدمة وتقنيات التصوير الحديثة. البطارية في موتورولا ايدج 20 قوية وتدوم طويلاً، مما يمكنك من استخدام الهاتف طوال اليوم دون الحاجة إلى شحن متكرر. بالإضافة إلى ذلك، يدعم الهاتف خاصية الشحن السريع، مما يوفر لك الوقت ويضمن أن يكون هاتفك جاهزاً للاستخدام في أي وقت. شركة موتورولا معروفة بجودتها وابتكاراتها في مجال الهواتف الذكية، و موتورولا ايدج 20 لا يختلف عن ذلك. إنه يجمع بين الأداء المتميز والسعر المناسب، مما يجعله واحداً من أفضل الخيارات في السوق. بفضل تصميمه الأنيق ومواصفاته المتقدمة، يلبي موتورولا ايدج 20 جميع احتياجاتك اليومية بكفاءة وسهولة. اقتناء موتورولا ايدج 20 يعني الحصول على هاتف ذكي متكامل يقدم قيمة ممتازة مقابل السعر، مع جميع الميزات التي تحتجاها للاستمتاع بتجربة استخدام سلسة ومريحة. إنه الهاتف المثالي لمن يبحث عن الجودة والأداء بسعر معقول.",
  ),
  Product(
    id: "HPN10",
    price: 559,
    title: "هواوي نوفا 10",
    type: "هاتف",
    subTitle: "متوسط",
    company: listCompany[2],
    image: nova10,
    description:
        "هاتف هواوي نوفا 10 هاتف متوسط يتمتع ب تصميم جذاب. يأتي الهاتف بشاشة IPS LCD مقاس 6.4 بوصة تعرض الألوان بوضوح ونقاء، مما يساهم في تجربة مشاهدة مريحة. يعمل نوفا 10 بمعالج Kirin 710 ثماني النواة الذي يوفر أداءً قويًا وفعالًا لتلبية احتياجاتك اليومية من التطبيقات والألعاب. يتوفر الهاتف بذاكرة وصول عشوائي تصل إلى 8 جيجابايت، مما يسهل تشغيل التطبيقات المتعددة والألعاب الثقيلة بسلاسة. يعمل نوفا 10 بنظام التشغيل Android 10 مع واجهة EMUI 10 التي توفر تجربة استخدام مرنة وسلسة. يأتي الهاتف بكاميرا ثلاثية العدسة تضم عدسة رئيسية بدقة 48 ميجابكسل، بالإضافة إلى كاميرا واسعة الزاوية وكاميرا ماكرو لمزيد من التنوع في التصوير. تتميز نوفا 10 أيضًا ببطارية بسعة 4000 مللي أمبير تدوم لفترة طويلة من الاستخدام المتواصل، مما يجعله خيارًا مثاليًا للأشخاص الذين يحتاجون إلى هاتف متوسط الفئة بأداء جيد وتصميم مميز.",
  ),
  Product(
    id: "HPNY90",
    price: 239,
    title: "هواوي واي 90",
    type: "هاتف",
    subTitle: "غير قابل للكسر",
    company: listCompany[2],
    image: y90,
    description:
        "هاتف هواوي Y 90 هاتف متوسط يتمتع ب تصميم جذاب. يأتي الهاتف بشاشة TFT LCD مقاس 6.5 بوصة تعرض الألوان بوضوح، مما يساهم في تجربة مشاهدة مريحة للمستخدمين. يعمل Y 90 بمعالج MediaTek Helio A22 رباعي النواة الذي يوفر أداءً كافيًا للتطبيقات اليومية والمهام الأساسية. يتوفر الهاتف بذاكرة وصول عشوائي تصل إلى 3 جيجابايت، مما يساعد على تحسين أداء النظام وسلاسة التعامل. يعمل Y 90 بنظام التشغيل Android 9 Pie مع واجهة EMUI 9.1 البسيطة والسهلة الاستخدام. يأتي الهاتف بكاميرا أساسية بدقة 13 ميجابكسل لالتقاط الصور اليومية بجودة مقبولة، بالإضافة إلى كاميرا سيلفي بدقة 5 ميجابكسل لالتقاط صور شخصية واضحة. تتميز Y 90 أيضًا ببطارية بسعة 3020 مللي أمبير تكفي للاستخدام اليومي، مما يجعله خيارًا مناسبًا للأشخاص الذين يبحثون عن هاتف يوفر الأساسيات بتصميم محدث وأداء معقول.",
  ),
  Product(
    id: "NPP1",
    price: 499,
    title: "نوثينق فون 1",
    type: "هاتف",
    subTitle: "واجهة بنظام خام",
    company: listCompany[4],
    image: nothing1,
    description:
        "هاتف نوثيق فون 1 هو هاتف من شركة نوثيق ينتمي إلى فئة الهواتف المتوسطة العليا، ويتميز بسعر رائع مقابل الأداء الذي يقدمه. يأتي الهاتف بواجهة نظام Android نظيفة وخالية من الإضافات الزائدة، مما يضمن تجربة استخدام سلسة وسريعة للمستخدمين. يتمتع نوثيق فون 1 بمعالج قوي يساعد على تشغيل التطبيقات والألعاب بسلاسة دون تأخير، مما يجعله مثاليًا للأشخاص الذين يبحثون عن جهاز يوفر أداءً سريعًا وفعالًا في استخداماتهم اليومية. بالإضافة إلى ذلك، يتميز الهاتف بشاشة عالية الدقة توفر تجربة مشاهدة ممتعة للمحتوى المتعدد الوسائط، وببطارية كبيرة السعة تدوم طويلاً مع الاستخدام المكثف. بفضل تصميمه الأنيق والمتين، يعد نوثيق فون 1 خيارًا مثاليًا للأفراد الذين يتطلعون إلى هاتف يجمع بين الأداء المتميز والتكلفة المناسبة.",
  ),
];
